test_RA/src/Documents/РасходТовара/РасходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходТовара</name>
  <registerRecords>AccumulationRegister.ОборотыТоваров</registerRecords>
  <registerRecords>InformationRegister.СредняяЦена</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусДокумента</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

test_RA/src/InformationRegisters/СредняяЦена/СредняяЦена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СредняяЦена</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

test_RA/src/AccumulationRegisters/ОборотыТоваров/ОборотыТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОборотыТоваров</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

test_RA/src/Documents/РасходТовара/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим) 
	
	ПроведениеДокументовСервер.ПровестиДокумент(Отказ, Ссылка);

	
	//ТоварыДокумента = ПереченьТоваров.Выгрузить(); //Выгрузка из табличной части в ТабЗнач
	//ТоварыДокумента.Свернуть("Товар", "Количество"); // Сворачивам результаты (Количество суммируется в разрезе группы товар)
	//Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//               |	ОстаткиТоваровОстатки.Организация КАК Организация,
	//               |	ОстаткиТоваровОстатки.Товар КАК Товар,
	//               |	СУММА(ОстаткиТоваровОстатки.ОстатокОстаток) КАК Остаток
	//               |ИЗ
	//               |	РегистрНакопления.ОстаткиТоваров.Остатки(НАЧАЛОПЕРИОДА(&ДатаОстатка, МИНУТА), ) КАК ОстаткиТоваровОстатки
	//               |ГДЕ
	//               |	ОстаткиТоваровОстатки.Организация = &Организация
	//               |	И ОстаткиТоваровОстатки.Товар В(&Товары)
	//               |
	//               |СГРУППИРОВАТЬ ПО
	//               |	ОстаткиТоваровОстатки.Организация,
	//               |	ОстаткиТоваровОстатки.Товар
	//               |
	//               |ИМЕЮЩИЕ
	//               |	СУММА(ОстаткиТоваровОстатки.ОстатокОстаток) > 0
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	Товар"; 
	//
	//Запрос.УстановитьПараметр("ДатаОстатка", Дата);
	//Запрос.УстановитьПараметр("Организация", Организация);
	//Запрос.УстановитьПараметр("Товары", ТоварыДокумента.ВыгрузитьКолонку("Товар")); // только те товары, которые запрошены в документе
	//ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	//Для Каждого Строка Из ТоварыДокумента Цикл
	//	
	//	НайденаЗапись = ТаблицаРезультат.НайтиСтроки(Новый Структура("Товар", Строка.Товар));
	//	Если НайденаЗапись.Количество() = 0 Тогда 
	//		Отказ = Истина;
	//		//Прервать;
	//		Сообщить("Недостаточно товара: " + Строка(Строка.Товар) + " , в наличии: 0");
	//		Продолжить; //Остатков нет, поэтому дальше цикл не выполнять
	//	КонецЕсли;
	//	
	//	Остаток = НайденаЗапись[0].Остаток;
	//	Если Строка.Количество > Остаток Тогда
	//		Отказ = Истина;
	//		Сообщить("Недостаточно товара: " + Строка(Строка.Товар) + " , в наличии: " 
	//				+ Строка(Остаток));
	//	КонецЕсли;

	//КонецЦикла;	
	//
	//Если Отказ Тогда

	//	Возврат;

	//КонецЕсли; 
	//
	////{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//// Данный фрагмент построен конструктором.
	//// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	//// регистр ОстаткиТоваров Расход
	//Движения.ОстаткиТоваров.Записывать = Истина;
	//Для Каждого ТекСтрокаПереченьТоваров Из ПереченьТоваров Цикл
	//	Движение = Движения.ОстаткиТоваров.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//	Движение.Период = Дата;
	//	Движение.Товар = ТекСтрокаПереченьТоваров.Товар;
	//	Движение.Организация = Организация;
	//	Движение.Остаток = ТекСтрокаПереченьТоваров.Количество;
	//КонецЦикла;

	// регистр СредняяЦена
	Для Каждого ТекСтрокаПереченьТоваров Из ПереченьТоваров Цикл
	Движения.СредняяЦена.Записывать = Истина;
	Движение = Движения.СредняяЦена.Добавить();
	Движение.Период = Дата;
	Движение.Документ = Ссылка;
	Движение.Товар = ТекСтрокаПереченьТоваров.Товар;
	Движение.Цена = ТекСтрокаПереченьТоваров.Цена/ТекСтрокаПереченьТоваров.Количество;
	КонецЦикла;


	// регистр ОборотыТоваров
	Для Каждого ТекСтрокаПереченьТоваров Из ПереченьТоваров Цикл

	Движения.ОборотыТоваров.Записывать = Истина;
	Движение = Движения.ОборотыТоваров.Добавить();
	Движение.Период = Дата;
	Движение.Товар = ТекСтрокаПереченьТоваров.Товар;
	Движение.Организация = Организация;
	Движение.Количество = ТекСтрокаПереченьТоваров.Количество;
	КонецЦикла;

	
	
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ 
	КонецПроцедуры
